## Staging Plan
#### SHA: `9fcee330aaf6f1740e1e33ab6d758fe3f596a580`
#### PR: `10`

#### ⚙️  Initialize `success`
#### 🗄️ Workspace ``   
#### 📖 Plan `success`

<details><summary>Show Plan</summary>

```

module.postbuild_pointy.aws_acm_certificate.app_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/1472e0e6-f850-44d4-8aa1-d4a4ab90bc66]
module.postbuild_pointy.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:cluster/pointy]
module.postbuild_pointy.aws_acm_certificate.www_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/bd717904-4407-49ce-a2b9-4cff4411a61b]
module.postbuild_pointy.aws_iam_role.lambda_exec: Refreshing state... [id=-pointy-lambda_execution_role]
module.postbuild_pointy.aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::533267310428:policy/-pointy-lambda_sns_policy]
module.postbuild_pointy.aws_sns_topic.ecs_alerts: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts]
module.redirect_reviso.aws_acm_certificate.old_domain_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/03ff5118-2632-4f96-ba3f-bcaa4d8770d8]
module.postbuild_pointy.aws_lambda_function.ecs_alerts: Refreshing state... [id=-pointy-ECSCPUAlerts]
module.postbuild_pointy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=-pointy-lambda_execution_role-20250220220734220800000001]
module.redirect_reviso.aws_lb.redirect_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-biz-redirect-alb/f81071d1fb62a779]
module.postbuild_pointy.aws_lb.web_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-web-alb/4a61b96ac7b3592d]
module.postbuild_pointy.aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-app-alb/22245f02fa9f475a]
module.postbuild_pointy.aws_route53_record.www_cert_validation["www.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__bbc58cc88f1bbef5f1672734bb3e3b31.www.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_route53_record.app_cert_validation["app.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__b6e4ae139628a416e254bc5d74611182.app.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_ecs_task_definition.web: Refreshing state... [id=pointy-web]
module.redirect_reviso.aws_route53_record.old_domain_cert_validation["www.reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz._CNAME]
module.redirect_reviso.aws_route53_record.old_domain_cert_validation["app.reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz._CNAME]
module.redirect_reviso.aws_route53_record.old_domain_cert_validation["reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__2d19292f3c0065d0ba4d585ac3cb4f68.reviso.biz._CNAME]
module.postbuild_pointy.aws_ecs_task_definition.server: Refreshing state... [id=pointy-server]
module.postbuild_pointy.aws_acm_certificate_validation.app_cert_validation: Refreshing state... [id=2025-02-20 20:13:55.824 +0000 UTC]
module.postbuild_pointy.aws_acm_certificate_validation.www_cert_validation: Refreshing state... [id=2025-02-20 20:13:52.975 +0000 UTC]
module.redirect_reviso.aws_acm_certificate_validation.old_domain_cert_validation: Refreshing state... [id=2025-03-12 19:22:40.944 +0000 UTC]
module.postbuild_pointy.aws_lb_target_group.web_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-web-tg/4f5579b8a35681f2]
module.postbuild_pointy.aws_lb_target_group.server_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-server-tg/8883e71f215b1894]
module.postbuild_pointy.aws_lambda_permission.allow_sns_to_call_lambda: Refreshing state... [id=AllowExecutionFromSNS]
module.postbuild_pointy.aws_sns_topic_subscription.lambda_subscription: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts:05f03a16-b101-43dd-a6e3-10619c7d49d8]
module.redirect_reviso.aws_route53_record.old_web_domain: Refreshing state... [id=Z0893527DM29OSHJP7NG_www.reviso.biz_A]
module.redirect_reviso.aws_route53_record.old_app_domain: Refreshing state... [id=Z0893527DM29OSHJP7NG_app.reviso.biz_A]
module.redirect_reviso.aws_route53_record.old_root_domain: Refreshing state... [id=Z0893527DM29OSHJP7NG_reviso.biz_A]
module.redirect_reviso.aws_lb_listener.https_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-biz-redirect-alb/f81071d1fb62a779/dbaa68c00689f427]
module.redirect_reviso.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c]
module.postbuild_pointy.aws_route53_record.www: Refreshing state... [id=Z036564521TUMO3XKOL1V_www.test.pointy.ai_A]
module.postbuild_pointy.aws_lb_listener.www_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/60cb3ee4f67bd714]
module.postbuild_pointy.aws_lb_listener.server_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/f739ca38124d6010]
module.postbuild_pointy.aws_route53_record.app: Refreshing state... [id=Z036564521TUMO3XKOL1V_app.test.pointy.ai_A]
module.postbuild_pointy.aws_lb_listener.web_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/08b88ea108aaf6ae]
module.postbuild_pointy.aws_lb_listener.server_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/e65c2cb7718cd08b]
module.redirect_reviso.aws_lb_listener_rule.https_app_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/dbaa68c00689f427/86ec18c769d0a9a0]
module.redirect_reviso.aws_lb_listener_rule.https_www_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/dbaa68c00689f427/033f7eb73f39f97e]
module.redirect_reviso.aws_lb_listener_rule.https_root_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/dbaa68c00689f427/f2c56478f95dd8d6]
module.redirect_reviso.aws_lb_listener_rule.http_app_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/d880f779e074893c]
module.redirect_reviso.aws_lb_listener_rule.http_root_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/3e8c5cae5807c4a6]
module.redirect_reviso.aws_lb_listener_rule.http_www_domain_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener-rule/app/reviso-biz-redirect-alb/f81071d1fb62a779/99b84c1fc87e154c/c40ce9d1887bcb97]
module.postbuild_pointy.aws_ecs_service.server: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server]
module.postbuild_pointy.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.low_cpu_utilization: Refreshing state... [id=-pointy-low-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=-pointy-high-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.health_check_failures: Refreshing state... [id=-pointy-health-check-failures]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.postbuild_pointy.aws_ecs_task_definition.web has been changed
  ~ resource "aws_ecs_task_definition" "web" {
        id                       = "pointy-web"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild_pointy.aws_ecs_task_definition.server has been changed
  ~ resource "aws_ecs_task_definition" "server" {
        id                       = "pointy-server"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.postbuild_pointy.aws_ecs_service.server will be updated in-place
  ~ resource "aws_ecs_service" "server" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server"
        name                               = "pointy-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:14" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_service.web will be updated in-place
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web"
        name                               = "pointy-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:14" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.server must be replaced
-/+ resource "aws_ecs_task_definition" "server" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - systemControls        = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:49d049b5e6f7f65c3a33339961fd2f494cc18c45" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:9fcee330aaf6f1740e1e33ab6d758fe3f596a580"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-server" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:49d049b5e6f7f65c3a33339961fd2f494cc18c45" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:9fcee330aaf6f1740e1e33ab6d758fe3f596a580"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-web" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ pointy_ecs_deployment_task_definition = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:14" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```

</details>

*Pushed by: @fivetentaylor, Action: `pull_request`*